#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary><pre><code>
module.base.data.kubectl_path_documents.kubernetes-dashboard_manifests: Reading...
module.base.kubectl_manifest.container-registry[4]: Refreshing state... [id=/api/v1/namespaces/registry/persistentvolumeclaims/registry-pvc]
module.base.kubectl_manifest.container-registry[0]: Refreshing state... [id=/api/v1/namespaces/registry]
module.base.data.kubectl_path_documents.ntfy-server_manifests: Reading...
module.base.data.kubectl_path_documents.cronjobs_manifests: Reading...
module.base.data.kubectl_path_documents.home-assistant_manifests: Reading...
module.base.data.kubectl_path_documents.github-actions-user_manifests: Reading...
module.base.data.kubectl_path_documents.github-actions-user_manifests: Read complete after 0s [id=2b10eaf0017424cddc124258bab6ba69932decb83787a025f6f5a6d02f450fca]
module.base.kubectl_manifest.container-registry[2]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/registry/ingresses/registry-ingress]
module.base.kubectl_manifest.container-registry[1]: Refreshing state... [id=/apis/apps/v1/namespaces/registry/deployments/registry]
module.base.data.kubectl_path_documents.ntfy-server_manifests: Read complete after 0s [id=fdda3db367d30c63f91e884f973807ae7744fefc5b1400f69c593dc185de29bf]
module.base.data.kubectl_path_documents.cronjobs_manifests: Read complete after 0s [id=658da0e012860ba193f80e9a17c25e02569c9e149d060538096abe7f9d531ca3]
module.base.data.kubectl_path_documents.home-assistant_manifests: Read complete after 0s [id=09df2387fe7187e003053cf1fd0a15572b4eb905fd18e9af0c1d8aedb7f5999e]
module.base.data.kubectl_path_documents.cert-manager_manifests: Reading...
module.base.data.kubectl_path_documents.kubernetes-api-ingress_manifests: Reading...
module.base.data.kubectl_path_documents.postgres-db_manifests: Reading...
module.base.kubectl_manifest.container-registry[3]: Refreshing state... [id=/api/v1/namespaces/registry/services/registry-service]
module.base.data.kubectl_path_documents.kubernetes-api-ingress_manifests: Read complete after 0s [id=7250339a972f14aa42654622d6d0234afeb1adb184561b590bd54a9b8f62252b]
module.base.data.kubectl_path_documents.postgres-db_manifests: Read complete after 0s [id=e2f7f03843f3c2162f5e90dfa9829653117d4cc987e4532dd52f1d8a18337857]
module.base.data.kubectl_path_documents.kubernetes-dashboard_manifests: Read complete after 0s [id=dbae520aa30c9f2dbc550a9ba6267e508c673d11dc8a1c11f11958be41683d44]
module.base.data.kubectl_path_documents.nfs-provisioner_manifests: Reading...
module.base.data.kubectl_path_documents.grafana_manifests: Reading...
module.base.data.kubectl_path_documents.nfs-provisioner_manifests: Read complete after 0s [id=f097068c63ecfc3117fd47ff06ec95f6c0afc268048600936f11c111fc3cf11b]
module.base.data.kubectl_path_documents.esphome_manifests: Reading...
module.base.data.kubectl_path_documents.esphome_manifests: Read complete after 0s [id=613d6d238e62af12c40a9fc37059a088f0731dba002a9ae288a16fe0471cf8ce]
module.base.data.kubectl_path_documents.parking-reservation-cronjob_manifests: Reading...
module.base.data.kubectl_path_documents.grafana_manifests: Read complete after 0s [id=c0eb890c4368c54774ec91c677cac4cd1de7d9602abcb39a4baaa62066e67b0f]
module.base.data.kubectl_path_documents.nginx-ingress_manifests: Reading...
module.base.data.kubectl_path_documents.container-registry-data_manifests: Reading...
module.base.data.kubectl_path_documents.parking-reservation-cronjob_manifests: Read complete after 0s [id=cc98b34c10970aaa092bb01d6f7938ba05ace4a509ab2dd45077b6adafa67a8a]
module.base.kubectl_manifest.github-actions-user[0]: Refreshing state... [id=/api/v1/namespaces/gh-actions]
module.base.data.kubectl_path_documents.nginx-ingress_manifests: Read complete after 0s [id=fc40915db8535d493554c2ffab1771d225c567cdb89b4af923541b40d5d711bb]
module.base.data.kubectl_path_documents.container-registry-data_manifests: Read complete after 0s [id=2c5fa35d5dc1bf08d879cf2c781d40e067fce5937b6aaad910239e72f02adca7]
module.base.kubectl_manifest.github-actions-user[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/gh-actions-user]
module.base.kubectl_manifest.github-actions-user[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/gh-actions-user]
module.base.data.kubectl_path_documents.cert-manager_manifests: Read complete after 0s [id=df45bd1b86f89322295c665fe5f12bacf42b9b98c73064a2879cb7b77d4476d4]
module.base.kubectl_manifest.github-actions-user[3]: Refreshing state... [id=/api/v1/namespaces/gh-actions/secrets/gh-actions-user-secret]
module.base.kubectl_manifest.github-actions-user[4]: Refreshing state... [id=/api/v1/namespaces/gh-actions/serviceaccounts/gh-actions-user]
module.base.kubectl_manifest.nfs-provisioner[5]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/nfs-provisioner/rolebindings/leader-locking-nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[4]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/nfs-provisioner/roles/leader-locking-nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[0]: Refreshing state... [id=/api/v1/namespaces/nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/run-nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/nfs-provisioner-runner]
module.base.kubectl_manifest.nfs-provisioner[6]: Refreshing state... [id=/api/v1/namespaces/nfs-provisioner/serviceaccounts/nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[3]: Refreshing state... [id=/apis/apps/v1/namespaces/nfs-provisioner/deployments/nfs-provisioner]
module.base.kubectl_manifest.nfs-provisioner[7]: Refreshing state... [id=/apis/storage.k8s.io/v1/storageclasses/ssd]
module.base.kubectl_manifest.cert-manager[15]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-clusterissuers]
module.base.kubectl_manifest.cert-manager[32]: Refreshing state... [id=/apis/apps/v1/namespaces/cert-manager/deployments/cert-manager-cainjector]
module.base.kubectl_manifest.cert-manager[19]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-ingress-shim]
module.base.kubectl_manifest.cert-manager[33]: Refreshing state... [id=/apis/apps/v1/namespaces/cert-manager/deployments/cert-manager]
module.base.kubectl_manifest.cert-manager[9]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-edit]
module.base.kubectl_manifest.cert-manager[46]: Refreshing state... [id=/api/v1/namespaces/cert-manager/serviceaccounts/cert-manager]
module.base.kubectl_manifest.cert-manager[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-cainjector]
module.base.kubectl_manifest.cert-manager[3]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-clusterissuers]
module.base.kubectl_manifest.cert-manager[37]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cert-manager-cainjector:leaderelection]
module.base.kubectl_manifest.cert-manager[22]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-webhook:subjectaccessreviews]
module.base.kubectl_manifest.cert-manager[0]: Refreshing state... [id=/api/v1/namespaces/cert-manager]
module.base.kubectl_manifest.cert-manager[27]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/clusterissuers.cert-manager.io]
module.base.kubectl_manifest.cert-manager[41]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cert-manager:leaderelection]
module.base.kubectl_manifest.cert-manager[8]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-view]
module.base.kubectl_manifest.cert-manager[7]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-ingress-shim]
module.base.kubectl_manifest.cert-manager[12]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-webhook:subjectaccessreviews]
module.base.kubectl_manifest.cert-manager[34]: Refreshing state... [id=/apis/apps/v1/namespaces/cert-manager/deployments/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[17]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-orders]
module.base.kubectl_manifest.cert-manager[35]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/ca-issuer-stg]
module.base.kubectl_manifest.cert-manager[38]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/roles/cert-manager:leaderelection]
module.base.kubectl_manifest.cert-manager[25]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/certificates.cert-manager.io]
module.base.kubectl_manifest.cert-manager[5]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-orders]
module.base.kubectl_manifest.cert-manager[16]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-certificates]
module.base.kubectl_manifest.cert-manager[43]: Refreshing state... [id=/api/v1/namespaces/cert-manager/services/cert-manager]
module.base.kubectl_manifest.cert-manager[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-issuers]
module.base.kubectl_manifest.cert-manager[21]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-certificatesigningrequests]
module.base.kubectl_manifest.cert-manager[45]: Refreshing state... [id=/api/v1/namespaces/cert-manager/serviceaccounts/cert-manager-cainjector]
module.base.kubectl_manifest.cert-manager[10]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-approve:cert-manager-io]
module.base.kubectl_manifest.cert-manager[29]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/orders.acme.cert-manager.io]
module.base.kubectl_manifest.cert-manager[36]: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/ca-issuer]
module.base.kubectl_manifest.cert-manager[39]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/cert-manager/roles/cert-manager-webhook:dynamic-serving]
module.base.kubectl_manifest.cert-manager[28]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/issuers.cert-manager.io]
module.base.kubectl_manifest.cert-manager[24]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/certificaterequests.cert-manager.io]
module.base.kubectl_manifest.cert-manager[11]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-certificatesigningrequests]
module.base.kubectl_manifest.cert-manager[42]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/cert-manager/rolebindings/cert-manager-webhook:dynamic-serving]
module.base.kubectl_manifest.cert-manager[47]: Refreshing state... [id=/api/v1/namespaces/cert-manager/serviceaccounts/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[44]: Refreshing state... [id=/api/v1/namespaces/cert-manager/services/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[30]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/mutatingwebhookconfigurations/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[13]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-cainjector]
module.base.kubectl_manifest.cert-manager[20]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-approve:cert-manager-io]
module.base.kubectl_manifest.cert-manager[18]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-challenges]
module.base.kubectl_manifest.cert-manager[23]: Refreshing state... [id=/api/v1/namespaces/cert-manager/configmaps/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[26]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/challenges.acme.cert-manager.io]
module.base.kubectl_manifest.cert-manager[6]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-challenges]
module.base.kubectl_manifest.cert-manager[4]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/cert-manager-controller-certificates]
module.base.kubectl_manifest.cert-manager[14]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/cert-manager-controller-issuers]
module.base.kubectl_manifest.cert-manager[31]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/validatingwebhookconfigurations/cert-manager-webhook]
module.base.kubectl_manifest.cert-manager[40]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/cert-manager-cainjector:leaderelection]
module.base.kubectl_manifest.postgres-db[5]: Refreshing state... [id=/api/v1/namespaces/postgres/services/postgres-service]
module.base.kubectl_manifest.postgres-db[4]: Refreshing state... [id=/api/v1/namespaces/postgres/secrets/postgres-secret]
module.base.kubectl_manifest.postgres-db[6]: Refreshing state... [id=/api/v1/namespaces/postgres/persistentvolumeclaims/postgres-pvc]
module.base.kubectl_manifest.postgres-db[0]: Refreshing state... [id=/api/v1/namespaces/postgres]
module.base.kubectl_manifest.postgres-db[1]: Refreshing state... [id=/api/v1/namespaces/postgres/configmaps/postgres-config]
module.base.kubectl_manifest.postgres-db[2]: Refreshing state... [id=/api/v1/namespaces/postgres/configmaps/postgres-init]
module.base.kubectl_manifest.postgres-db[3]: Refreshing state... [id=/apis/apps/v1/namespaces/postgres/deployments/postgres]
module.base.kubectl_manifest.nginx-ingress[7]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/validatingwebhookconfigurations/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[13]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/rolebindings/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[5]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/configmaps/ingress-nginx-controller]
module.base.kubectl_manifest.nginx-ingress[0]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[3]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[4]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[9]: Refreshing state... [id=/apis/batch/v1/namespaces/ingress-nginx/jobs/ingress-nginx-admission-create]
module.base.kubectl_manifest.nginx-ingress[14]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/rolebindings/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[18]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/serviceaccounts/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[16]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/services/ingress-nginx-controller-admission]
module.base.kubectl_manifest.nginx-ingress[8]: Refreshing state... [id=/apis/apps/v1/namespaces/ingress-nginx/deployments/ingress-nginx-controller]
module.base.kubectl_manifest.nginx-ingress[11]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/roles/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[12]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/ingress-nginx/roles/ingress-nginx-admission]
module.base.kubectl_manifest.nginx-ingress[6]: Refreshing state... [id=/apis/networking.k8s.io/v1/ingressclasses/nginx]
module.base.kubectl_manifest.nginx-ingress[17]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/serviceaccounts/ingress-nginx]
module.base.kubectl_manifest.nginx-ingress[15]: Refreshing state... [id=/api/v1/namespaces/ingress-nginx/services/ingress-nginx-controller]
module.base.kubectl_manifest.nginx-ingress[10]: Refreshing state... [id=/apis/batch/v1/namespaces/ingress-nginx/jobs/ingress-nginx-admission-patch]
module.base.kubectl_manifest.nginx-ingress[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/ingress-nginx]
module.base.kubectl_manifest.kubernetes-dashboard[3]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/configmaps/kubernetes-dashboard-settings]
module.base.kubectl_manifest.kubernetes-dashboard[9]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/secrets/kubernetes-dashboard-certs]
module.base.kubectl_manifest.kubernetes-api-ingress[0]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/default/ingresses/kubeapi]
module.base.kubectl_manifest.kubernetes-dashboard[13]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/services/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[0]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[4]: Refreshing state... [id=/apis/apps/v1/namespaces/kubernetes-dashboard/deployments/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[6]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/kubernetes-dashboard/ingresses/kubernetes-ingress]
module.base.kubectl_manifest.kubernetes-dashboard[8]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubernetes-dashboard/rolebindings/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[7]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubernetes-dashboard/roles/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[11]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/secrets/kubernetes-dashboard-key-holder]
module.base.kubectl_manifest.kubernetes-dashboard[10]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/secrets/kubernetes-dashboard-csrf]
module.base.kubectl_manifest.kubernetes-dashboard[14]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/services/dashboard-metrics-scraper]
module.base.kubectl_manifest.kubernetes-dashboard[12]: Refreshing state... [id=/api/v1/namespaces/kubernetes-dashboard/serviceaccounts/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubernetes-dashboard]
module.base.kubectl_manifest.kubernetes-dashboard[5]: Refreshing state... [id=/apis/apps/v1/namespaces/kubernetes-dashboard/deployments/dashboard-metrics-scraper]
module.base.kubectl_manifest.grafana[1]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/postgres/ingresses/grafana-ingress]
module.base.kubectl_manifest.grafana[0]: Refreshing state... [id=/apis/apps/v1/namespaces/postgres/deployments/grafana]
module.base.kubectl_manifest.grafana[2]: Refreshing state... [id=/api/v1/namespaces/postgres/services/grafana]
module.base.kubectl_manifest.grafana[3]: Refreshing state... [id=/api/v1/namespaces/postgres/persistentvolumeclaims/grafana-pvc]
module.base.kubectl_manifest.home-assistant[5]: Refreshing state... [id=/api/v1/namespaces/homeassistant/persistentvolumeclaims/ha-pvc]
module.base.kubectl_manifest.home-assistant[0]: Refreshing state... [id=/api/v1/namespaces/homeassistant]
module.base.kubectl_manifest.home-assistant[1]: Refreshing state... [id=/api/v1/namespaces/homeassistant/configmaps/homeassistant-config]
module.base.kubectl_manifest.home-assistant[2]: Refreshing state... [id=/apis/apps/v1/namespaces/homeassistant/deployments/homeassistant]
module.base.kubectl_manifest.home-assistant[3]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/homeassistant/ingresses/homeassistant-ingress]
module.base.kubectl_manifest.home-assistant[4]: Refreshing state... [id=/api/v1/namespaces/homeassistant/services/homeassistant]
module.base.kubectl_manifest.esphome[0]: Refreshing state... [id=/apis/apps/v1/namespaces/homeassistant/deployments/esphome]
module.base.kubectl_manifest.esphome[3]: Refreshing state... [id=/api/v1/namespaces/homeassistant/persistentvolumeclaims/esphome-pvc]
module.base.kubectl_manifest.esphome[1]: Refreshing state... [id=/apis/networking.k8s.io/v1/namespaces/homeassistant/ingresses/esphome-ingress]
module.base.kubectl_manifest.esphome[2]: Refreshing state... [id=/api/v1/namespaces/homeassistant/services/esphome]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.base.helm_release.container-registry will be created
  + resource "helm_release" "container-registry" {
      + atomic                     = false
      + chart                      = "docker-registry-ui"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "container-registry"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.joxit.dev"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 6000
      + values                     = [
          + <<-EOT
                global:
                  imagePullPolicy: IfNotPresent
                
                ui:
                  deleteImages: true
                  runAsRoot: false
                  defaultTheme: dark
                  image: joxit/docker-registry-ui:2.4.1
                  proxy: true
                
                  service:
                    type: ClusterIP
                    port: 80
                    targetPort: 1024
                
                  ingress:
                    enabled: true
                    annotations:
                      cert-manager.io/cluster-issuer: ca-issuer
                      nginx.ingress.kubernetes.io/backend-protocol: HTTP
                      nginx.ingress.kubernetes.io/auth-tls-verify-client: "on"
                      nginx.ingress.kubernetes.io/auth-tls-secret: "ingress-nginx/spof-cert"
                      nginx.ingress.kubernetes.io/auth-tls-verify-depth: "1"
                      nginx.ingress.kubernetes.io/auth-tls-error-page: "https://wompampsupport.azureedge.net/fetchimage?siteId=7575&v=2&jpgQuality=100&width=700&url=https%3A%2F%2Fi.kym-cdn.com%2Fentries%2Ficons%2Fmobile%2F000%2F002%2F144%2FYou_Shall_Not_Pass!_0-1_screenshot.jpg"
                      nginx.ingress.kubernetes.io/auth-tls-pass-certificate-to-upstream: "true"
                    host: registry.spof.tech
                    tls:
                      - hosts:
                        - registry.spof.tech
                        secretName: registry-certs
                
                registry:
                  enabled: true
                  image: registry:2.8.1
                  dataVolume:
                    persistentVolumeClaim:
                      claimName: registry-pvc
                  service:
                    type: ClusterIP
                    port: 5000
                    targetPort: 5000
                  extraEnv:
                    - name: REGISTRY_AUTH
                      value: "htpasswd"
                    - name: REGISTRY_AUTH_HTPASSWD_REALM
                      value: "Registry Realm"
                    - name: REGISTRY_AUTH_HTPASSWD_PATH
                      value: "/var/lib/registry/htpasswd"
                
                  ingress:
                    enabled: true
                    host: docker.spof.tech
                    tls:
                      - hosts:
                        - docker.spof.tech
                        secretName: docker-certs
                    annotations:
                      cert-manager.io/cluster-issuer: ca-issuer
                      nginx.ingress.kubernetes.io/backend-protocol: HTTP
                      nginx.ingress.kubernetes.io/proxy-body-size: 2G
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.base.kubectl_manifest.container-registry-data[0] will be created
  + resource "kubectl_manifest" "container-registry-data" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "registry-htpasswd"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              htpasswd: spof:$2y$05$q2SdvvvXtd/wk7Fmcb7Uyu/e5mE4p2mcTY0.As/DAvciNHBUTAfzS
            kind: ConfigMap
            metadata:
              name: registry-htpasswd
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.container-registry-data[1] will be created
  + resource "kubectl_manifest" "container-registry-data" {
      + api_version             = "batch/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Job"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "registry-copy-job"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: batch/v1
            kind: Job
            metadata:
              name: registry-copy-job
            spec:
              template:
                spec:
                  containers:
                  - command:
                    - /bin/sh
                    - -c
                    - cp /registry-htpasswd/htpasswd /registry-data/htpasswd
                    image: busybox
                    name: registry-copy-job
                    volumeMounts:
                    - mountPath: /registry-data
                      name: registry-data
                    - mountPath: /registry-htpasswd
                      name: registry-htpasswd
                  restartPolicy: Never
                  volumes:
                  - name: registry-data
                    persistentVolumeClaim:
                      claimName: registry-pvc
                  - configMap:
                      name: registry-htpasswd
                    name: registry-htpasswd
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.container-registry-data[2] will be created
  + resource "kubectl_manifest" "container-registry-data" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PersistentVolumeClaim"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "registry-pvc"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: PersistentVolumeClaim
            metadata:
              name: registry-pvc
            spec:
              accessModes:
              - ReadWriteMany
              resources:
                requests:
                  storage: 5Gi
              storageClassName: ssd
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.cronjobs[0] will be created
  + resource "kubectl_manifest" "cronjobs" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cronjobs"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: cronjobs
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.home-assistant[1] will be created
  + resource "kubectl_manifest" "home-assistant" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "homeassistant"
      + namespace               = "homeassistant"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                app: homeassistant
              name: homeassistant
              namespace: homeassistant
            spec:
              replicas: 1
              selector:
                matchLabels:
                  app: homeassistant
              template:
                metadata:
                  labels:
                    app: homeassistant
                spec:
                  containers:
                  - image: ghcr.io/home-assistant/home-assistant:2023.6
                    name: home-assistant
                    ports:
                    - containerPort: 8123
                      name: http
                      protocol: TCP
                    volumeMounts:
                    - mountPath: /config
                      name: ha-storage
                  nodeSelector:
                    kubernetes.io/arch: amd64
                    kubernetes.io/hostname: hp-elitedesk
                  volumes:
                  - name: ha-storage
                    persistentVolumeClaim:
                      claimName: ha-pvc
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.home-assistant[2] must be replaced
-/+ resource "kubectl_manifest" "home-assistant" {
      ~ api_version             = "apps/v1" -> "networking.k8s.io/v1" # forces replacement
      ~ id                      = "/apis/apps/v1/namespaces/homeassistant/deployments/homeassistant" -> (known after apply)
      ~ kind                    = "Deployment" -> "Ingress" # forces replacement
      ~ live_manifest_incluster = (sensitive value)
      ~ live_uid                = "e9b5cfcc-a067-4d2f-8a51-1b541a6bec4c" -> (known after apply)
      ~ name                    = "homeassistant" -> "homeassistant-ingress" # forces replacement
      ~ uid                     = "9f8566f4-de2b-4018-b015-d37a41bedf74" -> (known after apply)
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
          - apiVersion: apps/v1
          - kind: Deployment
          + apiVersion: networking.k8s.io/v1
          + kind: Ingress
            metadata:
          -   labels:
          -     app: homeassistant
          -   name: homeassistant
          +   annotations:
          +     cert-manager.io/cluster-issuer: ca-issuer
          +     nginx.ingress.kubernetes.io/auth-tls-error-page: https://wompampsupport.azureedge.net/fetchimage?siteId=7575&v=2&jpgQuality=100&width=700&url=https%3A%2F%2Fi.kym-cdn.com%2Fentries%2Ficons%2Fmobile%2F000%2F002%2F144%2FYou_Shall_Not_Pass!_0-1_screenshot.jpg
          +     nginx.ingress.kubernetes.io/auth-tls-pass-certificate-to-upstream: "true"
          +     nginx.ingress.kubernetes.io/auth-tls-secret: ingress-nginx/spof-cert
          +     nginx.ingress.kubernetes.io/auth-tls-verify-client: "on"
          +     nginx.ingress.kubernetes.io/auth-tls-verify-depth: "1"
          +     nginx.ingress.kubernetes.io/backend-protocol: HTTP
          +   name: homeassistant-ingress
              namespace: homeassistant
            spec:
          -   replicas: 1
          -   selector:
          -     matchLabels:
          -       app: homeassistant
          -   template:
          -     metadata:
          -       labels:
          -         app: homeassistant
          -     spec:
          -       containers:
          -       - image: ghcr.io/home-assistant/home-assistant:2022.12
          -         name: home-assistant
          -         ports:
          -         - containerPort: 8123
          -           name: http
          -           protocol: TCP
          -         volumeMounts:
          -         - mountPath: /config
          -           name: ha-storage
          -       initContainers:
          -       - args:
          -         - cp /config/configuration.yaml /config-ha/configuration.yaml; cp /config/automations.yaml
          -           /config-ha/automations.yaml; cp /config/scripts.yaml /config-ha/scripts.yaml;
          -           cp /config/scenes.yaml /config-ha/scenes.yaml
          -         command:
          -         - /bin/sh
          -         - -c
          -         image: busybox
          -         name: init-homeassistant
          -         volumeMounts:
          -         - mountPath: /config
          -           name: ha-config
          -         - mountPath: /config-ha
          -           name: ha-storage
          -       nodeSelector:
          -         kubernetes.io/arch: amd64
          -         kubernetes.io/hostname: hp-elitedesk
          -       volumes:
          -       - name: ha-storage
          -         persistentVolumeClaim:
          -           claimName: ha-pvc
          -       - configMap:
          -           name: homeassistant-config
          -         name: ha-config
          +   ingressClassName: nginx
          +   rules:
          +   - host: home.spof.tech
          +     http:
          +       paths:
          +       - backend:
          +           service:
          +             name: homeassistant
          +             port:
          +               number: 8123
          +         path: /
          +         pathType: Prefix
          +   tls:
          +   - hosts:
          +     - home.spof.tech
          +     secretName: ha-certs
        EOT
      ~ yaml_incluster          = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.base.kubectl_manifest.home-assistant[3] must be replaced
-/+ resource "kubectl_manifest" "home-assistant" {
      ~ api_version             = "networking.k8s.io/v1" -> "v1" # forces replacement
      ~ id                      = "/apis/networking.k8s.io/v1/namespaces/homeassistant/ingresses/homeassistant-ingress" -> (known after apply)
      ~ kind                    = "Ingress" -> "Service" # forces replacement
      ~ live_manifest_incluster = (sensitive value)
      ~ live_uid                = "e4aff651-1feb-40c7-ab99-9e6231b0ec27" -> (known after apply)
      ~ name                    = "homeassistant-ingress" -> "homeassistant" # forces replacement
      ~ uid                     = "dc66a891-25ec-416a-b802-5f76560e0513" -> (known after apply)
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
          - apiVersion: networking.k8s.io/v1
          - kind: Ingress
          + apiVersion: v1
          + kind: Service
            metadata:
          -   annotations:
          -     cert-manager.io/cluster-issuer: ca-issuer
          -     nginx.ingress.kubernetes.io/auth-tls-error-page: https://wompampsupport.azureedge.net/fetchimage?siteId=7575&v=2&jpgQuality=100&width=700&url=https%3A%2F%2Fi.kym-cdn.com%2Fentries%2Ficons%2Fmobile%2F000%2F002%2F144%2FYou_Shall_Not_Pass!_0-1_screenshot.jpg
          -     nginx.ingress.kubernetes.io/auth-tls-pass-certificate-to-upstream: "true"
          -     nginx.ingress.kubernetes.io/auth-tls-secret: ingress-nginx/spof-cert
          -     nginx.ingress.kubernetes.io/auth-tls-verify-client: "on"
          -     nginx.ingress.kubernetes.io/auth-tls-verify-depth: "1"
          -     nginx.ingress.kubernetes.io/backend-protocol: HTTP
          -   name: homeassistant-ingress
          +   name: homeassistant
              namespace: homeassistant
            spec:
          -   ingressClassName: nginx
          -   rules:
          -   - host: home.spof.tech
          -     http:
          -       paths:
          -       - backend:
          -           service:
          -             name: homeassistant
          -             port:
          -               number: 8123
          -         path: /
          -         pathType: Prefix
          -   tls:
          -   - hosts:
          -     - home.spof.tech
          -     secretName: ha-certs
          +   ports:
          +   - name: http
          +     nodePort: 30000
          +     port: 8123
          +     protocol: TCP
          +   selector:
          +     app: homeassistant
          +   type: NodePort
        EOT
      ~ yaml_incluster          = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.base.kubectl_manifest.home-assistant[4] must be replaced
-/+ resource "kubectl_manifest" "home-assistant" {
      ~ id                      = "/api/v1/namespaces/homeassistant/services/homeassistant" -> (known after apply)
      ~ kind                    = "Service" -> "PersistentVolumeClaim" # forces replacement
      ~ live_manifest_incluster = (sensitive value)
      ~ live_uid                = "4a3bd4d7-b766-4c93-b9e6-b41274903bea" -> (known after apply)
      ~ name                    = "homeassistant" -> "ha-pvc" # forces replacement
      ~ uid                     = "c2de4272-ed21-4a0b-a4c6-528808fd9893" -> (known after apply)
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: v1
          - kind: Service
          + kind: PersistentVolumeClaim
            metadata:
          -   name: homeassistant
          +   name: ha-pvc
              namespace: homeassistant
            spec:
          -   ports:
          -   - name: http
          -     nodePort: 30000
          -     port: 8123
          -     protocol: TCP
          -   selector:
          -     app: homeassistant
          -   type: NodePort
          +   accessModes:
          +   - ReadWriteOnce
          +   resources:
          +     requests:
          +       storage: 1Gi
          +   storageClassName: ssd
        EOT
      ~ yaml_incluster          = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.base.kubectl_manifest.home-assistant[5] will be destroyed
  # (because index [5] is out of range for count)
  - resource "kubectl_manifest" "home-assistant" {
      - api_version             = "v1" -> null
      - apply_only              = false -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/api/v1/namespaces/homeassistant/persistentvolumeclaims/ha-pvc" -> null
      - kind                    = "PersistentVolumeClaim" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "5b3c869a-1ab5-402e-a912-9711c24f942f" -> null
      - name                    = "ha-pvc" -> null
      - namespace               = "homeassistant" -> null
      - server_side_apply       = false -> null
      - uid                     = "5d81d175-b3eb-43c2-9498-f993ef61648b" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: PersistentVolumeClaim
            metadata:
              name: ha-pvc
              namespace: homeassistant
            spec:
              accessModes:
              - ReadWriteOnce
              resources:
                requests:
                  storage: 1Gi
              storageClassName: ssd
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # module.base.kubectl_manifest.ntfy-server[0] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: ntfy
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[1] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-config"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              server.yml: |-
                base-url: "https://ntfy.spof.tech"
                listen-http: ":80"
                listen-https: ":443"
                key-file: "/etc/letsencrypt/live/tls.key"
                cert-file: "/etc/letsencrypt/live/tls.crt"
                cache-file: "/var/cache/ntfy/cache.db"
                cache-duration: "24h"
                attachment-cache-dir: "/var/cache/ntfy/attachments"
                attachment-file-size-limit: "1M"
                attachment-expiry-duration: "24h"
                auth-file: "/var/lib/ntfy/user.db"
                auth-default-access: "read-only"
                web-root: "/"
                global-topic-limit: 150
                visitor-subscription-limit: 30
                visitor-request-limit-burst: 60
                visitor-request-limit-replenish: "1m"
                behind-proxy: true
                upstream-base-url: "https://ntfy.sh"
            kind: ConfigMap
            metadata:
              name: ntfy-config
              namespace: ntfy
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[2] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                app: ntfy
              name: ntfy
              namespace: ntfy
            spec:
              replicas: 1
              selector:
                matchLabels:
                  app: ntfy
              template:
                metadata:
                  labels:
                    app: ntfy
                spec:
                  containers:
                  - args:
                    - serve
                    image: binwiederhier/ntfy:latest
                    name: ntfy
                    ports:
                    - containerPort: 80
                      name: http
                    - containerPort: 443
                      name: https
                    resources:
                      limits:
                        cpu: 500m
                        memory: 128Mi
                    volumeMounts:
                    - mountPath: /etc/ntfy/server.yml
                      name: config
                      readOnly: true
                      subPath: server.yml
                    - mountPath: /var/cache/ntfy
                      name: cache
                    - mountPath: /var/lib/ntfy
                      name: user-db
                    - mountPath: /etc/letsencrypt/live/
                      name: certs
                  volumes:
                  - configMap:
                      name: ntfy-config
                    name: config
                  - name: cache
                    persistentVolumeClaim:
                      claimName: ntfy-cache
                  - name: user-db
                    persistentVolumeClaim:
                      claimName: ntfy-user-db
                  - name: certs
                    secret:
                      secretName: ntfy-certs
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[3] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "networking.k8s.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Ingress"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-ingress"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: Ingress
            metadata:
              annotations:
                cert-manager.io/cluster-issuer: ca-issuer
                nginx.ingress.kubernetes.io/auth-tls-pass-certificate-to-upstream: "true"
                nginx.ingress.kubernetes.io/backend-protocol: HTTPS
              name: ntfy-ingress
              namespace: ntfy
            spec:
              ingressClassName: nginx
              rules:
              - host: ntfy.spof.tech
                http:
                  paths:
                  - backend:
                      service:
                        name: ntfy-tls
                        port:
                          name: https
                    path: /
                    pathType: Prefix
              tls:
              - hosts:
                - ntfy.spof.tech
                secretName: ntfy-certs
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[4] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-tls"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              name: ntfy-tls
              namespace: ntfy
            spec:
              ports:
              - name: http
                port: 80
                targetPort: 80
              - name: https
                port: 443
                targetPort: 443
              selector:
                app: ntfy
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[5] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PersistentVolumeClaim"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-cache"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: PersistentVolumeClaim
            metadata:
              name: ntfy-cache
              namespace: ntfy
            spec:
              accessModes:
              - ReadWriteOnce
              resources:
                requests:
                  storage: 500Mi
              storageClassName: ssd
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.ntfy-server[6] will be created
  + resource "kubectl_manifest" "ntfy-server" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "PersistentVolumeClaim"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "ntfy-user-db"
      + namespace               = "ntfy"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: PersistentVolumeClaim
            metadata:
              name: ntfy-user-db
              namespace: ntfy
            spec:
              accessModes:
              - ReadWriteOnce
              resources:
                requests:
                  storage: 100Mi
              storageClassName: ssd
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.base.kubectl_manifest.parking-reservation-cronjob[0] will be created
  + resource "kubectl_manifest" "parking-reservation-cronjob" {
      + api_version             = "batch/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "CronJob"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "parking-reservation"
      + namespace               = "cronjobs"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: batch/v1
            kind: CronJob
            metadata:
              name: parking-reservation
              namespace: cronjobs
            spec:
              jobTemplate:
                spec:
                  template:
                    spec:
                      containers:
                      - image: docker.spof.tech/spof/parking-reservation:latest
                        name: parking-reservation
                        pullPolicy: IfNotPresent
                      restartPolicy: OnFailure
              schedule: 15 00 * * *
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 17 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

</code></pre></details>

*Pushed by: @chr1s-code, Action: `pull_request`*
<!-- Sticky Pull Request Comment -->